FILES/InformationRegisters/СобытияОбъектов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<InformationRegister>
		<Properties>
			<Name>СобытияОбъектов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Обработчик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФункцииОписания</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ОбъектСобытия</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказКлиентаБТ</v8:Type>
						<v8:Type>cfg:CatalogRef.ЭлементСвязаннойНоменклатуры</v8:Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.НаборХарактеристикДляЭкстраПолей</v8:Type>
						<v8:Type>cfg:DocumentRef.Услуга</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказКомандированногоБТ</v8:Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.НаборХарактеристикДляНоменклатуры</v8:Type>
						<v8:Type>cfg:CatalogRef.ИдентификаторыОбъектовМетаданных</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Событие</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СобытияБТ</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

FILES/InformationRegisters/СобытияОбъектов/Ext/ManagerModule.bsl
Функция ЗагрузитьПредопределенныеЗначения() Экспорт
	
	Макет = РегистрыСведений.СобытияОбъектов.ПолучитьМакет("ПредопределенныеЗначения");
	
	ТекущаяСтрока = 1;
	ВыполнятьЗагрузку = Истина;
	Пока ВыполнятьЗагрузку Цикл
		ТекущаяСтрока = ТекущаяСтрока + 1;
		
		ОбъектСобытия = Макет.Область(ТекущаяСтрока, 1, ТекущаяСтрока, 1).Текст;
		Событие = Макет.Область(ТекущаяСтрока, 2, ТекущаяСтрока, 2).Текст;
		Обработчик = Макет.Область(ТекущаяСтрока, 3, ТекущаяСтрока, 3).Текст;
		
		Если ОбъектСобытия = "" Тогда
			ВыполнятьЗагрузку = Ложь;
		Иначе
			Попытка
				//Метаданные.Справочники.ФункцииОписания.Предопределенные
				МЗ = РегистрыСведений.СобытияОбъектов.СоздатьМенеджерЗаписи();
				МЗ.ОбъектСобытия = ПланыВидовХарактеристик.НаборХарактеристикДляНоменклатуры[ОбъектСобытия]; //Ненавижу составные поля (( 
				МЗ.Событие = Перечисления.СобытияБТ[Событие];
				МЗ.Обработчик = Справочники.ФункцииОписания[Обработчик];
				МЗ.Записать(Истина);
			Исключение
			КонецПопытки;
		КонецЕсли;
			
	КонецЦикла;
	
КонецФункции
